RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_usbfs_dev_drv.h
#include "cy_device.h"

#if defined (CY_IP_MXUSBFS) && defined (CY_IP_MXPERI)

#include "cy_dma.h"
#include "cy_trigmux.h"
#include "cy_usbfs_dev_drv_reg.h"

#if defined(__cplusplus)
extern "C" {
#endif

/*******************************************************************************
*                           Driver version and ID
*******************************************************************************/

/**
* \addtogroup group_usbfs_dev_drv_macros
* \{
*/

/** USBFS Driver major version */
#define CY_USBFS_VERSION_MAJOR      (2)

/** USBFS Driver minor version */
#define CY_USBFS_VERSION_MINOR      (20)

/** USBFS Driver identifier */
#define CY_USBFS_ID                 CY_PDL_DRV_ID(0x3BU)

/** USBFS Driver mode position in STATUS CODE: 0 - Device, 1 - Host */
#define CY_USBFS_MODE_POS           (15UL)

/** USBFS Driver status code Device */
#define CY_USBFS_DEV_DRV_STATUS_CODE    (0U)
/** \} group_usbfs_dev_drv_macros */


/*******************************************************************************
*                           Enumerated Types
*******************************************************************************/

/**
* \addtogroup group_usbfs_dev_drv_enums
* \{
*/
/** USBFS Device Driver return codes */
typedef enum
{
    /** Operation completed successfully */
    CY_USBFS_DEV_DRV_SUCCESS = 0U,

    /** One or more input parameters are invalid */
    CY_USBFS_DEV_DRV_BAD_PARAM               = (CY_USBFS_ID | CY_PDL_STATUS_ERROR | CY_USBFS_DEV_DRV_STATUS_CODE | 1U),

    /** There is not enough space in the buffer to be allocated for the endpoint (hardware or RAM) */
    CY_USBFS_DEV_DRV_BUF_ALLOC_FAILED        = (CY_USBFS_ID | CY_PDL_STATUS_ERROR | CY_USBFS_DEV_DRV_STATUS_CODE | 2U),

    /** Failure during DMA configuration */
    CY_USBFS_DEV_DRV_DMA_CFG_FAILED          = (CY_USBFS_ID | CY_PDL_STATUS_ERROR | CY_USBFS_DEV_DRV_STATUS_CODE | 3U),

    /** Timeout during dynamic reconfiguration */
    CY_USBFS_DEV_DRV_EP_DYN_RECONFIG_TIMEOUT = (CY_USBFS_ID | CY_PDL_STATUS_ERROR | CY_USBFS_DEV_DRV_STATUS_CODE | 4U),

    /** Timeout during execution of the DMA read request for the OUT endpoint
    * (only applicable in \ref group_usbfs_dev_drv_ep_management_mode2)
    */
    CY_USBFS_DEV_DRV_EP_DMA_READ_TIMEOUT     = (CY_USBFS_ID | CY_PDL_STATUS_ERROR | CY_USBFS_DEV_DRV_STATUS_CODE | 5U),

    /** Timeout during execution of the DMA read request for the OUT endpoint
    * (only applicable in \ref group_usbfs_dev_drv_ep_management_mode2)
    */
    CY_USBFS_DEV_DRV_EP_DMA_WRITE_TIMEOUT     = (CY_USBFS_ID | CY_PDL_STATUS_ERROR | CY_USBFS_DEV_DRV_STATUS_CODE | 6U),

} cy_en_usbfs_dev_drv_status_t;


/** Data Endpoints Buffer Management Mode */
typedef enum
{
    /** CPU manages a data transfer between the hardware endpoints buffer
    * and the user SRAM
    */
    CY_USBFS_DEV_DRV_EP_MANAGEMENT_CPU = 0,

    /** DMA manages data transfer between the hardware endpoints buffer and
    * the user SRAM
    */
    CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA = 1,

    /** The DMA automatically manages a data transfer between the hardware endpoints
    * FIFO buffer and the user SRAM
    */
    CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA_AUTO = 2,
} cy_en_usbfs_dev_drv_ep_management_mode_t;

/** Data Endpoint Register Access Type */
typedef enum
{
    CY_USBFS_DEV_DRV_USE_8_BITS_DR,     /**< Use 8-bits registers to access the data endpoints */
    CY_USBFS_DEV_DRV_USE_16_BITS_DR,    /**< Use 16-bits registers to access the data endpoints */
} cy_en_usbfs_dev_ep_access_t;

/** Service Callback Events (this enumerated type is used by middleware) */
typedef enum
{
    CY_USB_DEV_BUS_RESET = 0U,   /**< Callback hooked to the bus reset interrupt */
    CY_USB_DEV_EP0_SETUP = 1U,   /**< Callback hooked to the endpoint 0 SETUP packet interrupt */
    CY_USB_DEV_EP0_IN    = 2U,   /**< Callback hooked to the endpoint 0 IN packet interrupt */
    CY_USB_DEV_EP0_OUT   = 3U,   /**< Callback hooked to the endpoint 0 OUT packet interrupt */
} cy_en_usb_dev_service_cb_t;

/** Callback Sources */
typedef enum
{
    CY_USBFS_DEV_DRV_EP1 = 0U,   /**< Callback hooked to the Data Endpoint 1 completion interrupt */
    CY_USBFS_DEV_DRV_EP2 = 1U,   /**< Callback hooked to the Data Endpoint 2 completion interrupt */
    CY_USBFS_DEV_DRV_EP3 = 2U,   /**< Callback hooked to the Data Endpoint 3 completion interrupt */
    CY_USBFS_DEV_DRV_EP4 = 3U,   /**< Callback hooked to the Data Endpoint 4 completion interrupt */
    CY_USBFS_DEV_DRV_EP5 = 4U,   /**< Callback hooked to the Data Endpoint 5 completion interrupt */
    CY_USBFS_DEV_DRV_EP6 = 5U,   /**< Callback hooked to the Data Endpoint 6 completion interrupt */
    CY_USBFS_DEV_DRV_EP7 = 6U,   /**< Callback hooked to the Data Endpoint 7 completion interrupt */
    CY_USBFS_DEV_DRV_EP8 = 7U,   /**< Callback hooked to the Data Endpoint 8 completion interrupt */
    CY_USBFS_DEV_DRV_SOF = 8U,   /**< Callback hooked to the SOF packet received interrupt */
    CY_USBFS_DEV_DRV_LPM = 9U,   /**< Callback hooked to the LPM request received interrupt */
} cy_en_usbfs_dev_drv_cb_source_t;

/** Data Endpoint States (this enumerated type is used by middleware) */
typedef enum
{
    CY_USB_DEV_EP_IDLE,       /**< The endpoint is in an idle state after the configuration is set */
    CY_USB_DEV_EP_PENDING,    /**< The transfer targeted at an endpoint is in progress */
    CY_USB_DEV_EP_COMPLETED,  /**< The transfer targeted at an endpoint is completed */
    CY_USB_DEV_EP_STALLED,    /**< The endpoint is stalled */
    CY_USB_DEV_EP_DISABLED,   /**< The endpoint is disabled (not used in this configuration) */
    CY_USB_DEV_EP_INVALID,     /**< The endpoint is not supported by the hardware */
}  cy_en_usb_dev_ep_state_t;

/** USB Lines Control */
typedef enum
{
    CY_USBFS_DEV_DRV_FORCE_STATE_J    = 0xA0U,  /**< Force a J State onto the USB lines */
    CY_USBFS_DEV_DRV_FORCE_STATE_K    = 0x80U,  /**< Force a K State onto the USB lines */
    CY_USBFS_DEV_DRV_FORCE_STATE_SE0  = 0xC0U,  /**< Force a Single Ended 0 onto the USB lines */
    CY_USBFS_DEV_DRV_FORCE_STATE_NONE = 0x00U   /**< Return the bus to the SIE control */
} cy_en_usbfs_dev_drv_force_bus_state_t;

/** LPM (Link Power Management) Responses */
typedef enum
{
    /** The next LPM request will be responded with NACK */
    CY_USBFS_DEV_DRV_LPM_REQ_NACK = 0x0U,

    /** The next LPM request will be responded with ACK */
    CY_USBFS_DEV_DRV_LPM_REQ_ACK  = 0x1U,
} cy_en_usbfs_dev_drv_lpm_req_t;

/** USB Control EP0 transfer state  */
typedef enum
{
    CY_USBFS_DEV_DRV_EP0_CTRL_STATE_IDLE,
    CY_USBFS_DEV_DRV_EP0_CTRL_STATE_SETUP,
    CY_USBFS_DEV_DRV_EP0_CTRL_STATE_DATA,
    CY_USBFS_DEV_DRV_EP0_CTRL_STATE_STATUS_IN,
    CY_USBFS_DEV_DRV_EP0_CTRL_STATE_STATUS_OUT,
} cy_en_usbfs_dev_drv_ep0_ctrl_state_t;

/** \} group_usbfs_dev_drv_enums */


